meterhu/stm32f4/STM32F4BOOT/Transducer/MyTransdu.c
//===============================================================================================
/************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2012-05-20  
 *
 *            修改时间: 2012-05-20
 *            修改原因:
 *
 *                     
 *
 *                作者: 杨卫华
 *
 *************************************************************************************************/
 //===============================================================================================
#include "LPC17xx.h"    
#include "mystd.h"  
#include "m_config.h"
#include "main.h"
#include "UserLib.h"
#include "UART.h"
#include "Transdu.h"

//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void MyTransduRun(UINT16 rev_fwd, UINT16 rev_num)
{
    UINT8    i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    
    //DelayS(2);
    ///Wait(500000);
    Wait(350000);  
    //ENA_RS485_OUT();  
    //写入频率
	buff[0] = 0x01;
	
	if (rev_fwd == FWD_RUN)
    {
    	buff[1] = 0x07;  //写入单笔数据
    }
    else
    {
    	buff[1] = 0x08;  //写入单笔数据
    
    }
    
	buff[2] = 0x00;  //地址
	buff[3] = 0x00;
	    
	rev_num *= 10;
	rev_num /= 3;
	        
	buff[4] = rev_num >> 8;
	buff[5] = rev_num & 0xFF;
	    
	tmp_crc = CRCCheck(buff, 6);
	    
	buff[6] = tmp_crc & 0xFF;   //低位在先
	buff[7] = tmp_crc >> 8;
	
	//ENA_RS485_OUT();        
	for (i = 0; i < 8; i++)
	{
  	    TRANS_COM_SEND_BYTE(buff[i]);
	    Wait(30);
	    
	} 
	
	 
	//Wait(600);    
	//DIS_RS485_OUT(); 
  //   Wait(350000); 
    //Wait(600000);  
    
    
  	
    
          
}

//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void MyTransduStop(UINT16 rev_fwd)
{
    UINT8   i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    
    Wait(350000);  
    
    buff[0] = 0x01;
    buff[1] = 0x09;  //写入单笔数据
    buff[2] = 0x00;  //地址
    buff[3] = 0x00;
    
   
    tmp_crc = CRCCheck(buff, 4);
    
    buff[4] = tmp_crc & 0xFF;   //低位在先
    buff[5] = tmp_crc >> 8;
    
    //ENA_RS485_OUT();  
    for (i = 0; i < 6; i++)
    {
        TRANS_COM_SEND_BYTE(buff[i]);
        Wait(30);
    
    }  
    //Wait(600000); 
    //DIS_RS485_OUT();  
   
  
} 


